{
  "services": [
    {
      "title": "Support for TV, Films and Podcasts",
      "description": "Mindzone Media can supply, at short notice, Clinical Psychologists (Chartered and HCPC registered) with specialist expert experience for any type of television or film project in the UK or Overseas. This may include pre-production screening, support during production (on/off rig) and post-TX support. We work across all televisions genres including commercials/marketing projects, television dramas and mainstream films, including storyline development, script reviews, consultation and support for actors, compliance reviews, podcasts, as well as performance art projects.",
      "imageId": "support",
      "slug": "support",
      "order": 0,
      "image": "/assets/support.png"
    },
    {
      "title": "Mental Health Awareness and Resilience Training",
      "description": "We recognise that there is a greater incidence of Mental health difficulties in the film and TV industry workforce than in the general population. Training workshops are individually tailored to offer and improve production team's knowledge of mental health presentations for contributors and talent, minimise attrition, maintain the rights and dignity of vulnerable individuals, manage risk appropriately, supporting compliance requirements, and raising awareness for production team's self-care. \n\n\nWe also offer bespoke training designed for cast members ahead of major transmission and high-visibility exposure. This training equips the cast with the tools needed to remain resilient under intense public attention, covering managing emotional and mood trajectories during the pre- and post-broadcast period; navigating public scrutiny and media interviews with confidence and authenticity; social media management, and mastering life in the limelight.\n\n",
      "imageId": "mental-health",
      "slug": "mentalHealth",
      "order": 1,
      "image": "/assets/tesc-shoot.jpeg"
    },
    {
      "title": "Duty Of Care For Contributors and Actors",
      "description": "Mindzone Media offers psychological pre-filming Fitness to Participate consultations for productions involving children families and adults as well as embedded production crew.  The consultations considers aspects of mental health psychological resilience fitness to consent motivation to participate and implications for the participants and their broader family systems and reputation.  These consultations assist in casting as well as supporting the production process to draw on the contributor’s strengths.  Support may also be offered to the contributors during the production process on-location or on-rig post-production and follow-up and pre-transmission and post-transmission support.\nSpecialist support is further extended to the contributors who may be at risk of exposure to difficult and emotive material or due to undertake a physically or psychologically challenging project such as immersive projects blue lights series and undercover reporting.  Consultation for preparation for such projects and managing the decompression and reverse culture shock is further offered.  ",
      "imageId": "duty-of-care",
      "slug": "dutyOfCare",
      "order": 2
    },
    {
      "title": "Script and Development Treatment Reviews",
      "description": "Our comprehensive tailored script risk assessment identifies and mitigates potential risks linked to age across the lifespan, lived experience, and exposure to emotionally charged narratives, graphic material, and distressing language, as well as ensuring the accurate mental health portrayals while safeguarding actors from emotional distress, trauma, and ethical concerns.  We also place a strong emphasis on supporting neurodivergent actors who may experience unique challenges when engaging with intense roles or triggering material.\n \nWith expert-backed mitigation strategies, we can support filmmakers to recognise the psychological toll of intense roles and sensitive content, neurodiversity-informed role assessments, providing tailored strategies such as mental health support, role suitability assessments, and safe acting protocols, to safeguard your actors from emotional distress and trauma, while fostering a psychologically safe and inclusive environment, and help a production to deliver compelling and authentic stories without compromising well-being.",
      "imageId": "script",
      "slug": "script",
      "order": 3
    },
    {
      "title": "Employee Assistance and Staff Support",
      "description": "Our team of highly experienced Consultant Clinical Psychologists provide dedicated employee assistance and staff support tailored to the unique pressures of working in the Film, TV and media industry. We understand the fast-paced, high-pressure environments that production teams face, and offer confidential one-to-one support, mental health awareness workshops, resilience training, debriefing, and crisis response when needed. Whether it's managing stress, navigating difficult workplace dynamics, or supporting individuals through personal challenges, we deliver compassionate, evidence-based professional care that promotes mental health, resilience, and sustainable performance across the industry and the lifespan of a project.",
      "imageId": "employee-assistance",
      "slug": "employeeAssistance",
      "order": 4
    },
    {
      "title": "Location / On Call Support",
      "description": "Mindzone Media provides comprehensive support to your actors, cast, and crew, whether on-site or remotely, across international time zones. Our extensive experience includes working on large-format studio productions with high numbers of contributors, as well as more specialised and concentrated projects in remote locations and hostile environments. Our team can support any location. We are committed to ensuring the mental health needs of productions - considering, containing, and providing appropriate support to mitigate potential mental health risks and challenges.",
      "imageId": "on-call-support",
      "slug": "onCallSupport",
      "order": 5
    },
    {
      "title": "Supporting the Life Span of a Production",
      "description": " Mindzone Media supports all aspects of mental health and psychological risk management for production teams, cast, talent, and contributors across the lifespan of a project, for linear, streaming, and digital first content, TV, film,\npodcast, social media and performing arts. The service delivers end-to-end psychological and mental health support for media productions:\n \n- Development: Script/treatment reviews, scene risk assessments, and expert guidance on accurate, responsible portrayal of mental health, trauma, neurodiversity, welfare, hostile environments, endurance, true crime, and blue-light themes.\n- Pre-filming: Bespoke mental health training, Duty of Care protocols, and Fitness to Participate screening.\n- Filming: On-call, remote, and on-location support for cast and crew, and Employee Assistance support.\n- Post-filming: Comprehensive debriefing for cast, contributors, and production teams (including immersive productions).\n- Pre- and Post-Transmission: Ongoing risk mitigation, exposure management, social media support, and long-term aftercare for cast and contributors.",
      "imageId": "production-lifespan",
      "slug": "lifeSpan",
      "specialType": null,
      "order": 6,
      "image": "/assets/mindzone-timeline-3.jpg"
    }
  ]
}
