{
  "teamMembers": [
    {
      "name": "Dr Howard Fine",
      "title": "Clinical Psychologist",
      "image": "/assets/howard.png",
      "description": "Mindzone Media was founded by [Dr. Howard Fine](http://www.drhowardfine.com/), Consultant Clinical Psychologist.  As well as supporting media projects, and working in private practice, Dr. Fine is a co-founder of [Recolo UK Ltd](http://recolo.co.uk/) offering expert, high quality and effective community neuropsychological rehabilitation to children and their families.  Dr. Howard Fine had worked as the Lead Paediatric Neuropsychologist at the Royal London Hospital where he worked for 6 years delivering highly specialised paediatric neurorehabilitation in an acute setting and specialist child neuropsychological consultation services for clinicians working in the London boroughs of Tower Hamlets, Hackney and Newham.  He is a member of the Foreign, Commonwealth & Development Office / [British Red Cross](http://www.redcross.org.uk/What-we-do/Emergency-response/International-emergency-response/Emergency-response-units) Emergency Trauma Support Team, responding to international disasters involving British citizens. Dr. Howard Fine sits on the Clinical Advisory Group for the National Trauma Networks, advising on policy and service provision for frontline trauma services.  He is also a sessional lecturer at Birkbeck College, University of London, as well as a visiting lecturer at the University of East London, University of Surrey, Royal Holloway University of London, and the Institute of Child Health."
    },
    {
      "name": "Dr Susanna Waern",
      "title": "Clinical Psychologist",
      "image": "/assets/img_0813.jpeg",
      "description": "Dr Susanna Waern, Consultant Clinical Psychologist, qualified as a Clinical Psychologist in 2007. Susanna has supported media projects since 2015 and has worked on a wide range of programmes, offering consultation to production teams, psychological interviews with potential participants, on-location support and pre-and post-transmission support. She works with both adults and children, including vulnerable people with complex health, mental health and learning needs. She has worked on programmes spanning a wide range of genres, including children’s programmes, reality shows, challenge programmes, talent shows, documentaries and news programmes. She has worked on programmes airing on all major UK channels (BBC, ITV, Channel 4 and Channel 5) as well as streaming services such as Netflix, Apple TV, Amazon Prime Video and Disney+. \nSusanna has a strong clinical background in paediatric psychology and neuropsychology and at the time of leaving the NHS in 2022, she was leading the Paediatric Psychological Support Team at the Royal Marsden Hospital. Susanna has also provided therapy independently across the lifespan, provided neurorehabilitation for children and is an experienced clinical supervisor, researcher and educator, being a guest lecturer at  University College London for seven years and presenting at conferences both nationally and internationally.  Susanna is fluent in Swedish and conversational Spanish."
    },
    {
      "name": "Dr Robin Bennett",
      "title": "Clinical Psychologist",
      "image": "/assets/whatsapp-image-2025-10-22-at-13.54.17.jpeg",
      "description": "Dr. Robin Bennett, Consultant Clinical Psychologist, works in both independent practice and the NHS, including South London & Maudsley and Great Ormond Street Hospital.  He has a specialist interest in trauma, child development, autism, working with children and adults.  He has supported media projects since 2011 and has supported a wide genre of programmes (obs docs, factual, education, entertainment) including consultation, screening, after-care, and on-location support, working across the lifespan. He lectures regularly at several London university MSc and Doctoral courses, national conferences and also trains mental health clinicians nationally and internationally. As well as delivering psychological assessments and support to contributors, Dr. Robin Bennett has also provided expert opinion during live interviews for LBC, talkRADIO and BBC News."
    },
    {
      "name": "Dr Anna Caffrey",
      "title": "Clinical Psychologist",
      "image": "/assets/headshot-mzm.jpg",
      "description": "Dr. Anna Caffrey qualified as a Clinical Psychologist in 2006. She divides her professional time working as a Clinical Lead in the NHS, where she undertakes specialist assessment and treatment of adult patients with complex and severe mood, anxiety and personality disorders and working in private practice. She has a specialist interest and further post-graduate training in working with trauma and PTSD. Anna is an accredited Cognitive Behavioural Therapist (CBT) with the BABCP and Eye Movement Desensitisation and Reprocessing (EMDR) therapist with EMDR Europe. She provides clinical and managerial supervision to other psychological therapists. Anna joined Mindzone Media in 2019."
    },
    {
      "name": "Dr Sophie Gosling",
      "title": "Clinical Psychologist",
      "image": "/assets/img_0120.jpg",
      "description": "\n\n\n\nDr Sophie Gosling qualified as a Clinical Psychologist in\n1993. She is an HCPC registered, BPS Chartered Clinical Psychologist and is an\nAssociate Fellow of the BPS. She offers a breadth and depth of clinical\nexpertise, working effectively with adults, children, young people and\nfamilies. She has supported Mindzone Media since 2016, with experience of a\nbroad range of genres across the lifespan of productions including Educating Yorkshire, Secret Genius, Come Dine With Me, Faking it etc. Dr Gosling’s areas of expertise\ninclude paediatric brain injury, neurodiversity, trauma, disability and chronic\nconditions. In her NHS work she has worked with vulnerable families from a\ndiverse range of backgrounds, in the paediatric, hospital and community mental\nhealth sectors. She has held a range of leadership roles, in mental health\nservices for adolescents, paediatric HIV services, and is currently Psychology\nLead at Recolo UK Ltd, a paediatric neurorehabilitation service.  She also has a strong academic background,\nco-authoring over 30 papers, articles and book chapters and has presented at\nnumerous conferences. Dr Gosling has also worked outside of the UK, in Belgium\nand Australia, holding academic and clinical posts."
    },
    {
      "name": "Dr Mekayla Zahra",
      "title": "Clinical Psychologist",
      "image": "/assets/zahra.png",
      "description": "Dr. Mekayla Zahra qualified as a Clinical Psychologist in 2012 and has over 15 years experience within the NHS and private sector organisations working with adults and children across the lifespan. She currently works as the Senior Clinical Psychologist in an NHS specialist CAMHS service for Unaccompanied Asylum-Seeking Children (UASC). Her areas of specialist interest and expertise are in the field of complex trauma and PTSD, working therapeutically with young people, and providing training and psychological consultation to the wider professional systems. Through her work with Asylum Seeking Children, Mekayla is skilled in providing assessment and intervention alongside interpreters. Mekayla joined Mindzone Media in 2024, bringing five years previous production experience. She has worked on a range of media projects including children’s programmes, medical and true crime documentaries, challenge and competitions, and immersive experience programmes."
    },
    {
      "name": "Dr Megan Prowse",
      "title": "Clinical Psychologist",
      "image": "/assets/megan-1.png",
      "description": "Dr. Megan Prowse is the Lead Clinical Psychologist for Neurology at Great Ormond Street Hospital where she manages the service, provides consultation to Neurologists, Neurosurgeons, and the wider medical team working with rare medical conditions.  Megan consults and supervises professionals in hospitals, schools, and community teams, as well as working with individuals and families. Megan has worked in a range of NHS adult mental health and forensic settings, with individuals managing psychosis, brain injury and long-term physical health conditions.  She has further specialised in complex trauma with ex-military personnel, Paediatric Neuropsychology, and family interventions for adolescents with eating disorders. Prior to pursuing a career in Psychology, Megan trained full-time as a Dancer in a performing arts school. Megan is also an associate for Recolo UK Ltd in neurorehabilitation and supervises and teaches on the University of Bath Doctorate in Clinical Psychology. Megan combines her personal and professional experience of the performing arts and entertainment industry with her extensive skills in psychological assessment, formulation, and intervention to provide consultation and risk assessment for production companies. She has worked on a range of projects including dating programmes,  factual documentaries on education, mental health, medical procedures, true crime, and immersive projects and competition series."
    },
    {
      "name": "Dr Neil Rees",
      "title": "Clinical Psychologist",
      "image": "/assets/whatsapp-image-2025-10-20-at-21.56.12.jpeg",
      "description": "Dr Neil Rees joined Mindzone Media in 2025 and quickly started work on a broad range of productions. He is a highly experienced Clinical Psychologist who has worked within the NHS for over 30 years, and has been a Consultant Clinical Psychologist for 20 of those years. Neil has extensive experience of working across the lifespan (adults, young people and children) in mental health and physical health settings. He is a trauma specialist and has trained in Eye Movement Desensitisation Reprocessing therapy (EMDR). Neil worked in academia for 19 years and was the Clinical Programme Director of the doctoral training programme in Clinical Psychology at the University of East London. He spent 12 years working with the British Red Cross as part of the Psychosocial Support Team which deploys overseas with the Foreign, Commonwealth & Development Office to support British citizens and FCDO staff affected by emergency situations. He has been deployed numerous times overseas and in the UK. Neil currently leads a large wellbeing psychology service for NHS staff at Guy’s & St Thomas’ NHS Foundation Trust."
    },
    {
      "name": "Mia Freedman",
      "title": "Operations Director",
      "image": "/assets/img_0864.jpeg",
      "description": "Mia Freedman joins the team as Operations Director. With over 24 years of experience in the TV industry, she brings with her a wealth of knowledge and organisational skills. Mia has worked across the spectrum of Unscripted TV with career highlights including Laura Whitmore Investigates, Secrets Of The Interrogation Room with Rob Rinder, and I Wanna Marry Harry to name a few. Mia oversees the operations at Mindzone Media to support relationships, logistics, and liaison between production teams and the clinical team, becoming the primary point of contact for any production needs and queries."
    }
  ]
}
