{
  "teamMembers": [
    {
      "name": "Dr Howard Fine",
      "title": "Consultant Clinical Psychologist, Founder of Mindzone Media",
      "image": "/assets/img_8433.jpg",
      "description": "Dr. Fine is a Consultant Clinical Psychologist, and the founder of Mindzone Media, specialising in supporting film, TV, podcasts, digital first and media production companies, in the key areas of mental health and psychological risk management for production teams, cast and talent, and contributors. Dr. Fine has extensive experience in consulting with media productions, advising on psychological and mental health themes, accurate depiction and description, and supporting accessible public dissemination of such themes, supporting the industry for almost two decades, including working on endurance, challenge and band shows, such as Squid Games, SAS Who Dares Wins, Hunted, Traitors, Big Brother, The Challenge and Building The Band, through to observational, true crime and blue-light documentaries such as Critical: Between Life and Death, Shoot To Kill: Terror on the Tube, Tinder Swindler, American Nightmare, Kill List, and Me and The Voices in My Head. Dr. Fine is a regular contributor to conference panels, podcast, media interviews, and published commentary on Duty of Care in the film and TV industry. \n\nDr. Fine is also a co-founder of Recolo UK Ltd offering expert, high quality and effective community neuropsychological rehabilitation to children and their families. He specialises in Paediatric Neuropsychology and Neurorehabilitation, and Post-Traumatic Stress Disorder, with experience of working in acute hospital settings and in the community. He is a member of the Foreign, Commonwealth & Development Office / British Red Cross Emergency Trauma Support Team, responding to international disasters and crisis management involving British citizens. Dr. Howard Fine sits on the Clinical Advisory Group for the National Trauma Networks, advising on policy and service provision for frontline trauma services. He is also a visiting lecturer at the University of East London, University of Surrey, and Royal Holloway University of London, delivering teaching on Paediatric Neuropsychology, neurorehabilitation, and child neuropsychological assessment and formulation.",
      "credentials": "BSc (Hons) MSc PsychD C.Psychol AFBPsS, HCPC Registered"
    },
    {
      "name": "Dr Susanna Waern",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/image.jpeg",
      "description": "Dr Susanna Waern, Consultant Clinical Psychologist, has worked with Mindzone Media since 2015. Her experience includes pre-production consultation, screening of participants, on-location support, pre-and post-transmission support, crisis management and crew support. She offers support for both adults and children, including vulnerable people with complex health and mental health\n(including trauma) needs, neurodiversity diagnoses and brain injuries/learning needs. She has worked on programmes spanning a wide range of genres, including children’s programmes, reality TV, challenge programmes, true crime, dating programmes, cooking competitions, talent shows, game shows, property shows, documentaries, news/current affairs programmes, podcasts and feature films. Susanna has worked on programmes airing on all major UK channels as well as streaming services, including Netflix, Apple TV, Amazon Prime Video and Disney+. Susanna also works with Swedish production teams.  \n\nSusanna has a strong clinical background, having qualified as a HCPC registered Clinical Psychologist in 2007, working privately as well as having 15 years’ experience in the NHS, including as a team lead. Her main clinical expertise is in child work, neuropsychology, physical health conditions (in particular cancer), palliative care, and bereavement. Susanna is fluent in Swedish and also speaks Spanish.",
      "credentials": "BSc (Hons), PsychD, PGDip, HCPC Registered"
    },
    {
      "name": "Dr Robin Bennett",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/7e573086-b6a2-4e5c-bf61-1a38c04e8083.jpg",
      "description": "Dr Robin Bennett is a Consultant Clinical Psychologist who has been supporting TV and film productions since 2011. He has worked behind the scenes on some of the UK’s and world’s best-known shows, protecting the wellbeing of contributors, talent, crew, and audiences.\n\nRobin brings a production-aware approach to every project, offering psychological screening, on-location support, and pre- and post-transmission care, always tailored to the needs of each production and contributor. His work has included projects involving children, vulnerable  participants, and immersive or high-pressure formats.\n\nWith decades of prior experience in the NHS, particularly supporting children with neurodevelopmental conditions and adults and children with PTSD, Robin is skilled in adapting his approach for neurodiverse and even non-verbal contributors.\n\nHis credits span BBC, ITV, Channel 4, Channel 5, Netflix, MTV, Sky, and multiple online platforms, across genres from documentary and true crime to dating, competition, and entertainment. He has also supported performance artists working in a challenging gallery exhibition.\n\nIn addition to production support, Robin delivers bespoke training for production teams on mental health, trauma-informed practice, safeguarding, and duty of care.",
      "credentials": " BSc (Hons), DClinPsy, C.Psychol, HCPC Registered"
    },
    {
      "name": "Dr Anna Caffrey",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/headshot-mzm.jpg",
      "description": "Dr. Anna Caffrey qualified as a Clinical Psychologist in 2006. She divides her professional time working as a Clinical Lead in the NHS, where she undertakes specialist assessment and treatment of adult patients with complex and severe mood, anxiety and personality disorders and working in private practice. She has a specialist interest and further post-graduate training in working with trauma and PTSD. Anna is an accredited Cognitive Behavioural Therapist (CBT) with the BABCP and Eye Movement Desensitisation and Reprocessing (EMDR) therapist with EMDR Europe. She provides clinical and managerial supervision to other psychological therapists. Anna joined Mindzone Media in 2019.",
      "credentials": "BSc (Hons), MSc by Research, PGCert, DClinPsy, C.Psychol, HCPC Registered "
    },
    {
      "name": "Dr Sophie Gosling",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/c66ee3d9-9857-4cbd-9c01-063ad53d50cb.jpg",
      "description": "Dr Sophie Gosling qualified as a Clinical Psychologist in 1993 with over 30 years experience. She is an HCPC registered, BPS Chartered Clinical Psychologist and is an Associate Fellow of the BPS. She offers a breadth and depth of clinical expertise, working effectively with adults, children, young people and families. She has supported Mindzone Media since 2016, with experience of a broad range of genres, offering assessment, debrief and post TX support, for contributors across the lifespan. She has worked on many projects such as Educating Yorkshire and Educating Manchester, Freddie Flintoff: Field of Dreams, Transformed ( YouTube), High Hoops (Drama), True Crime documentaries and podcasts, Dragon’s Den, Deal or No Deal and Squid Games: The Challenge. \n\nDr Gosling’s areas of clinical expertise include paediatric brain injury, neurodiversity, trauma, mental health, disability and chronic conditions. In her NHS work she has worked with vulnerable families from a diverse range of backgrounds, in the paediatric, hospital and community mental health sectors. She has held a range of leadership roles, in mental health services for adolescents, paediatric HIV services, and is currently Psychology Lead at Recolo UK Ltd, a paediatric neurorehabilitation service. She has a strong academic background, co-authoring over 30 papers, articles and book chapters and has presented at numerous conferences. Dr Gosling has worked in Belgium and Australia, holding academic and clinical posts.",
      "credentials": "BSc (Hons) PsychD C.Psychol AFBPsS, PGDip, HCPC Registered"
    },
    {
      "name": "Dr Mekayla Zahra",
      "title": "Clinical Psychologist ",
      "image": "/assets/whatsapp-image-2025-10-28-at-07.05.12.jpeg",
      "description": "Dr. Mekayla Zahra qualified as a Clinical Psychologist in 2012 and has over 15 years experience within the NHS and private sector organisations working with adults and children across the lifespan. Mekayla joined Mindzone Media in 2024, bringing five years previous production experience. She has worked on a range of media projects including children’s programmes, medical and true crime documentaries, challenge and competitions, and immersive experience programmes.\n\nMekayla currently works as the Senior Clinical Psychologist in an NHS specialist CAMHS service for Unaccompanied Asylum-Seeking Children (UASC). Her areas of specialist interest and expertise are in the field of complex trauma and PTSD, working therapeutically with young people, and providing training and psychological consultation to the wider professional systems. Through her work with Asylum Seeking Children, Mekayla is skilled in providing assessment and intervention alongside interpreters.",
      "credentials": "BSc (Hons), MSc, DClinPsy, HCPC Registered"
    },
    {
      "name": "Dr Megan Prowse",
      "title": "Chartered Clinical Psychologist ",
      "image": "/assets/bf497709-1be3-4065-852f-2ddd943a3f6c.jpeg",
      "description": "Dr Megan Prowse is a chartered, highly specialist Clinical Psychologist (CPsychol, BABCP) working in community paediatric neuropsychology, child & adult mental health. \n\nMegan has worked at Mindzone Media since 2022 , She has combined her psychological expertise with her prior training and experience in performing arts to provide support and training for young people & adults, particularly with lived experience, in preparing for difficult scripted roles. Megan specialises in film as well as TV within Mindzone Media, having successfully supported BBC, BFI and Sky productions with script reviews, assessments and on location cast and crew support. Film projects have included supporting individuals with neurodiversity, disabilities, complex mental health and trauma histories. She has worked with celebrities and high-profile contributors on tell-all documentaries, true crime documentaries and immersive reality projects. She has worked with content creators, influencers and social media celebrities as well as actors, presenters and media personalities, understanding their unique needs for pre, during and post-filming support both remotely and on location. \n\nMegan uses her experience of trauma informed practice and complex case work in the productions she works on, educating and supporting teams in managing risk and ensuring safe practice. Megan provides training and support for cast and staff for production teams undergoing difficult projects\nsuch as true crime documentaries, immersive projects, physical and mental health documentaries and complex film or scripted series, particularly involving young cast, or those with lived experience. \n\nMegan’s clinical experience is wide ranging; she has worked in specialist trauma centres, supporting ex -military personnel and front-line emergency workers, with complex post-traumatic stress disorder (C-PTSD) & complex\nmental health. She has also worked with young people with neurodiversity, trauma, physical health difficulties & acquired brain injuries. Megan was previously the lead psychologist for Neurology at Great Ormond Street Hospital and the BABCP lead on the Doctoral programme for clinical psychologists at the University of Bath, where she lectured, supervised practice and doctoral research projects, for trainee clinical psychologists.",
      "credentials": "BSC (Hons) CPsychol BABCP, HCPC Registered"
    },
    {
      "name": "Dr Neil Rees",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/5556e6dd-14b1-4537-81ba-6f064362f2dc.jpg",
      "description": "Dr Neil Rees joined Mindzone Media in 2025 and works across a wide range of television and media productions. A Consultant Clinical Psychologist with over 30 years of NHS experience, Neil brings extensive expertise in mental health, trauma, and staff wellbeing to his media work.\n\nNeil has contributed to numerous unscripted programmes, game shows, factual documentaries (including mental health, medical procedures, and true crime), as well as immersive projects, competition series, and podcasts. His work includes productions for many of the major UK broadcasters and production companies, as well as US networks and leading streaming platforms.\n\nNeil provides a comprehensive range of psychological services to productions — including consultation and training for production teams, pre-casting and risk assessments, on-location wellbeing support, and post-filming debriefs — helping ensure the psychological safety and welfare of contributors and crew.\n\nBefore moving into media, Neil spent over 30 years in the NHS, 20 of them as a Consultant Clinical Psychologist. He has worked across the lifespan (adults, young people and children)in both mental and physical health settings, including experience of learning difficulties and neurodiversity. He has extensive experience of working within the LGBTQ community. Neil worked in academia for 19 years and was the Clinical Programme Director of the doctoral training programme in Clinical Psychology at the University of East London. He is a trauma specialist and is trained in Eye Movement Desensitisation and Reprocessing (EMDR) therapy. He worked with the British Red Cross for over a decade, deploying overseas and in the UK during major emergencies. He has expertise in occupational health and staff wellbeing and recently led a large psychology service for NHS staff.",
      "credentials": "BSc (Hons), DClinPsy, CPsychol, HCPC Registered"
    },
    {
      "name": "Mia Freedman",
      "title": "Operations Director",
      "image": "/assets/img_6880.jpeg",
      "description": "Mia Freedman joins the team as Operations Director. With over 25 years of experience in the TV industry, she brings with her a wealth of knowledge and organisational skills. Mia has worked across the spectrum of Unscripted TV with career highlights including Laura Whitmore Investigates, Secrets Of The Interrogation Room with Rob Rinder, and I Wanna Marry Harry to name a few. Mia oversees the operations at Mindzone Media to support relationships, logistics, and liaison between production teams and the clinical team, becoming the primary point of contact for any production needs and queries."
    }
  ]
}
