{
  "teamMembers": [
    {
      "name": "Dr Howard Fine",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/a97804a1-f945-4055-aefc-efa7ebff0015.jpg",
      "description": "Mindzone Media was founded by [Dr. Howard Fine](http://www.drhowardfine.com/), Consultant Clinical Psychologist.  As well as supporting media projects, and working in private practice, Dr. Fine is a co-founder of [Recolo UK Ltd](http://recolo.co.uk/) offering expert, high quality and effective community neuropsychological rehabilitation to children and their families.  Dr. Howard Fine had worked as the Lead Paediatric Neuropsychologist at the Royal London Hospital where he worked for 6 years delivering highly specialised paediatric neurorehabilitation in an acute setting and specialist child neuropsychological consultation services for clinicians working in the London boroughs of Tower Hamlets, Hackney and Newham.  He is a member of the Foreign, Commonwealth & Development Office / [British Red Cross](http://www.redcross.org.uk/What-we-do/Emergency-response/International-emergency-response/Emergency-response-units) Emergency Trauma Support Team, responding to international disasters involving British citizens. Dr. Howard Fine sits on the Clinical Advisory Group for the National Trauma Networks, advising on policy and service provision for frontline trauma services.  He is also a sessional lecturer at Birkbeck College, University of London, as well as a visiting lecturer at the University of East London, University of Surrey, Royal Holloway University of London, and the Institute of Child Health.",
      "credentials": "BSc (Hons) MSc PsychD C.Psychol AFBPsS, HCPC Registered"
    },
    {
      "name": "Dr Susanna Waern",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/image.jpeg",
      "description": "\n\n\nDr Susanna Waern, Consultant Clinical Psychologist, has worked with Mindzone Media since 2015. Her experience includes pre-production consultation, screening of participants, on-location support, pre-and post-transmission support, crisis management and crew support. She offers support for both adults and children, including vulnerable people with complex health and mental health\n(including trauma) needs, neurodiversity diagnoses and brain injuries/learning needs. She has worked on programmes spanning a wide range of genres, including children’s programmes, reality TV, challenge programmes, true crime, dating programmes, cooking competitions, talent shows, game shows, property shows, documentaries,news/current affairs programmes, podcasts and feature films. Susanna has worked on programmes airing on all major UK channels as well as streaming services, including Netflix, Apple TV, Amazon Prime Video and Disney+. Susanna also works with Swedish production teams.  \n\nSusanna has a strong clinical background, having qualified as a HCPC registered clinical psychologist in 2007, working privately as well as having 15 years’ experience in the NHS, including as a team lead. Her main clinical expertise is in child work, neuropsychology, physical health conditions (in particular cancer), palliative care, and bereavement. Susanna is fluent in Swedish and also speaks Spanish.",
      "credentials": "BSc (Hons), PsychD, PGDip, HCPC Registered"
    },
    {
      "name": "Dr Robin Bennett",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/7e573086-b6a2-4e5c-bf61-1a38c04e8083.jpg",
      "description": "Dr. Robin Bennett, Consultant Clinical Psychologist, works in both independent practice and the NHS, including South London & Maudsley and Great Ormond Street Hospital.  He has a specialist interest in trauma, child development, autism, working with children and adults.  He has supported media projects since 2011 and has supported a wide genre of programmes (obs docs, factual, education, entertainment) including consultation, screening, after-care, and on-location support, working across the lifespan. He lectures regularly at several London university MSc and Doctoral courses, national conferences and also trains mental health clinicians nationally and internationally. As well as delivering psychological assessments and support to contributors, Dr. Robin Bennett has also provided expert opinion during live interviews for LBC, talkRADIO and BBC News.",
      "credentials": " BSc (Hons), DClinPsy, C.Psychol, HCPC Registered"
    },
    {
      "name": "Dr Anna Caffrey",
      "title": "Clinical Psychologist ",
      "image": "/assets/headshot-mzm.jpg",
      "description": "Dr. Anna Caffrey qualified as a Clinical Psychologist in 2006. She divides her professional time working as a Clinical Lead in the NHS, where she undertakes specialist assessment and treatment of adult patients with complex and severe mood, anxiety and personality disorders and working in private practice. She has a specialist interest and further post-graduate training in working with trauma and PTSD. Anna is an accredited Cognitive Behavioural Therapist (CBT) with the BABCP and Eye Movement Desensitisation and Reprocessing (EMDR) therapist with EMDR Europe. She provides clinical and managerial supervision to other psychological therapists. Anna joined Mindzone Media in 2019."
    },
    {
      "name": "Dr Sophie Gosling",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/c66ee3d9-9857-4cbd-9c01-063ad53d50cb.jpg",
      "description": "Dr Sophie Gosling qualified as a Clinical Psychologist\n\nShe is an HCPC registered, BPS Chartered Clinical Psychologist and is an Associate Fellow of the BPS. She offers a breadth and depth of clinical expertise, working effectively with adults, children, young people and families. She has supported Mindzone Media since 2016, with experience of a\nbroad range of genres across the lifespan of productions including Educating Yorkshire, Secret Genius, Come Dine With Me, Faking it etc. Dr Gosling’s areas of expertise include paediatric brain injury, neurodiversity, trauma, disability and chronic conditions. In her NHS work she has worked with vulnerable families from a diverse range of backgrounds, in the paediatric, hospital and community mental health sectors. She has held a range of leadership roles, in mental health services for adolescents, paediatric HIV services, and is currently Psychology Lead at Recolo UK Ltd, a paediatric neurorehabilitation service.  She also has a strong academic background, co-authoring over 30 papers, articles and book chapters and has presented at numerous conferences. Dr Gosling has also worked outside of the UK, in Belgium and Australia, holding academic and clinical posts.",
      "credentials": "BSc (Hons) PsychD C.Psychol AFBPsS, HCPC Registered"
    },
    {
      "name": "Dr Mekayla Zahra",
      "title": "Clinical Psychologist ",
      "image": "/assets/whatsapp-image-2025-10-28-at-07.05.12.jpeg",
      "description": "Dr. Mekayla Zahra qualified as a Clinical Psychologist in 2012 and has over 15 years experience within the NHS and private sector organisations working with adults and children across the lifespan. She currently works as the Senior Clinical Psychologist in an NHS specialist CAMHS service for Unaccompanied Asylum-Seeking Children (UASC). Her areas of specialist interest and expertise are in the field of complex trauma and PTSD, working therapeutically with young people, and providing training and psychological consultation to the wider professional systems. Through her work with Asylum Seeking Children, Mekayla is skilled in providing assessment and intervention alongside interpreters. Mekayla joined Mindzone Media in 2024, bringing five years previous production experience. She has worked on a range of media projects including children’s programmes, medical and true crime documentaries, challenge and competitions, and immersive experience programmes.",
      "credentials": "BSc (Hons), MSc, DClinPsy, HCPC Registered"
    },
    {
      "name": "Dr Megan Prowse",
      "title": "Clinical Psychologist ",
      "image": "/assets/megan-1.png",
      "description": "\n\n\n\n\nDr Megan Prowse is a chartered, highly specialist Clinical Psychologist (CPsychol, BABCP) working in community paediatric neuropsychology, supportingyoung people and families living with Acquired brain injury. Megan’s clinical experience is wide ranging; she has worked in specialist trauma centres, supporting ex-military with complex post-traumatic stress disorder (C-PTSD),and front-line emergency workers, she has also worked with young people with neurodiversity, trauma and physical health difficulties. Megan was previously the lead psychologist for neurology at Great Ormond Street Hospital and the BABCP lead on the Doctoral programme for clinical psychologists at the University\nof Bath, where she lectured, supervised practice and doctoral research projects,ensuring training met requirements for BABCP accreditation.\n\nMegan uses her experience of trauma- informed practice and complex case work in the productions she works on, educating and supporting teams in managing risk and ensuring safe practice. Megan provides training for cast and individual staff support for production teams undergoing difficult projects such as true crime documentaries, immersive projects and complex film or scripted series particularly involving young cast, or those with lived experience.  \n\nDuring her time at Mindzone Media, Megan has combined her psychological expertise with her prior training in performing arts (The Arts Educational school), focusing on ensuring young people as well as adults are supported in de-roleing and preparing for difficult scripted roles. Megan now\nspecialises in film as well as TV within Mindzone media, having successfully supported BBC, BFI and Sky productions with script reviews, assessments and on location cast and crew support. Film projects have included supporting individuals with neurodiversity, disabilities, complex mental health and trauma histories.  \n\nMegan provides location support, as well as support for production teams in prep, to consider risks ahead of time and plan support for cast and crew. Her most recent TV projects include immersive projects, true crime documentaries, programmes on medical procedures, physical and mental\nhealth, sexuality, as well as competition and challenge series. Megan has also supported celebrities in documentaries and tell-all projects.  \n\n \n\nUnscripted projects in the past year include; ‘Russell brand: In plain sight’, ‘The Jury: Murder Trial’, Inside: USA’, ‘Squid game: The Challenge’, ‘Castaway’, ‘Freddie Flintoff Field of dreams’, ‘Fortune\nHotel’, ‘Building the band’, ’99 to Beat’. ‘Race across the world’, ‘Beacon of Hope: The Grenfell Athletic story’. ‘Out of Order’. ‘The Voice Wales’, ‘Interior Design Maters’, ‘Bear Grylls Wild Reckoning’. \n\nScripted projects in the past year include; C4 drama series ‘Patience’, ‘The Crow Girl’, ‘Cold water’,  CCBC ‘High hoops’, ‘Ashley Walters directed film ‘Animol’. Richard Gadd’s ‘Half man’.",
      "credentials": "BSC (Hons) CPsychol BABCP, HCPC Registered"
    },
    {
      "name": "Dr Neil Rees",
      "title": "Consultant Clinical Psychologist ",
      "image": "/assets/5556e6dd-14b1-4537-81ba-6f064362f2dc.jpg",
      "description": "Dr Neil Rees joined Mindzone Media in 2025 and quickly started work on a broad range of productions. He is a highly experienced Clinical Psychologist who has worked within the NHS for over 30 years, and has been a Consultant Clinical Psychologist for 20 of those years. Neil has extensive experience of working across the lifespan (adults, young people and children) in mental health and physical health settings. He is a trauma specialist and has trained in Eye Movement Desensitisation Reprocessing therapy (EMDR). Neil worked in academia for 19 years and was the Clinical Programme Director of the doctoral training programme in Clinical Psychology at the University of East London. He spent 12 years working with the British Red Cross as part of the Psychosocial Support Team which deploys overseas with the Foreign, Commonwealth & Development Office to support British citizens and FCDO staff affected by emergency situations. He has been deployed numerous times overseas and in the UK. Neil currently leads a large wellbeing psychology service for NHS staff at Guy’s & St Thomas’ NHS Foundation Trust.",
      "credentials": "DClinPsy, CPsychol, HCPC Registered"
    },
    {
      "name": "Mia Freedman",
      "title": "Operations Director",
      "image": "/assets/img_6880.jpeg",
      "description": "Mia Freedman joins the team as Operations Director. With over 25 years of experience in the TV industry, she brings with her a wealth of knowledge and organisational skills. Mia has worked across the spectrum of Unscripted TV with career highlights including Laura Whitmore Investigates, Secrets Of The Interrogation Room with Rob Rinder, and I Wanna Marry Harry to name a few. Mia oversees the operations at Mindzone Media to support relationships, logistics, and liaison between production teams and the clinical team, becoming the primary point of contact for any production needs and queries."
    }
  ]
}
